{
  "entryMode": "Specifies the source of the value for this question:  \n* manually entered by the **user**,\n* **computed** using a specified expression and answers to other questions, \n* copied over from another **reference** answer to a question specified by a path, or \n* **autocreated** by a backend script (the logic for populating autocreated answers cannot be configured from the user interface).",
  "expression": "Supports javascript syntax, with special placeholder variables being populated with answers to other questions in the form.\n\nExample:\n\n```return @{laps} * @{lapLength:-100}```\n\n where `laps` and `lapLength` are the names of questions in the same form, `:-` is an optional marker for a default value, and `100` is the optional default value.",
  "enableUserEntry": "If enabled, the user is not restricted to using one of the suggestions in the dropdown, and may save their own text as the free-form answer to the question.",
  "disableMinMaxValueEnforcement": "If set, the value is not _required_ to be within the specified (**Min value**, **Max value**) limits, and an out of answer value will NOT be marked as invalid. A message will be displayed under the input, warning the user that the value they entered appears abnormal, without further consequences.",
  "messageForValuesOutsideMinMax": "Message that guides the user to enter values between **Min value** and **Max value**, displayed when **Min value** and/or **Max value** are specified but not enforced. If absent, a generic message 'Please enter values between ...' will be displayed.",
  "question": "Path to a question, either in this or a different questionnaire. Example: `/Questionnaires/Demographics/name`",
  "defaultCountry": "The default country code (ISO 3166), for example 'ca'.",
  "regions": "In the country dropdown, show only countries from certain regions or subregions, specified as a comma-separated list. For example:\n*  Regions - `america, europe, asia, oceania, africa`);\n* Subregions -`north-america, south-america, central-america, carribean, eu-union, ex-ussr, ex-yugos, baltic, middle-east, north-africa`.",
  "onlyCountries": "Explicit list of comma-separated country codes to be made available in the dropdown, for example `es, fr, it`.",
  "countries": "When address autocomplete is enabled by providing a Google API key, suggestions will be restricted to addresses from the countries listed here. Example value: `ca, us`.\n\nYou can set up the Google API key in **Administration** > **Google API Key**.",
  "searchPlacesAround": "When address autocomplete is enabled by providing a Google API key, suggestions will be biased around the provided coordinates. The value must be a JSON object with `east, west, north, south` keys and numbers as values. Example value: `{\"east\": -79.3, \"west\": -79.5, \"north\": 43.7, \"south\": 43.6}`.\n\nYou can set up the Google API key in **Administration** > **Google API Key**.",
  "variant": "Once a variant is chosen, the selectable zones must be specified as answer options. The values of the answer options must be selected from the list of compatible values for that variant.\n\n**Face** variant: `head`, `face`, `leftjaw`, `rightjaw`, `jaw`, `neck`, `throat`.\n\n**Full body** variant: `head`, `face`, `leftjaw`, `rightjaw`, `jaw`, `neck`, `throat`, `rightchest`, `leftchest`, `chest`, `leftshoulder`, `rightshoulder`, `leftupperarm`, `rightupperarm`, `leftelbow`, `rightelbow`, `leftlowerarm`, `rightlowerarm`, `leftwristhand`, `rightwristhand`, `leftwrist`, `rightwrist`, `lefthand`, `righthand`, `abdomen`,  `upperback`, `lowerback`, `pelvis`, `leftgroin`, `rightgroin`, `groin`, `righthip`, `lefthip`, `hip`, `rightbuttocks`, `leftbuttocks`, `buttocks`, `leftupperleg`, `rightupperleg`, `leftknee`, `rightknee`, `leftlowerleg`, `rightlowerleg`, `leftankle`, `rightankle`, `leftfoot`, `rightfoot`, `leftanklefoot`, `rightanklefoot`.",
  "updateMode": "Specifies when the value of this question should update.\n* always: Whenever the source answer is updated\n* initial_only: Record the source answer when the reference answer is created and never update"
}

